Public Attributes | List of all members
API_RGBAColor Struct Reference
View Handling
RGB color reference with transparency. More...
#include <APIdefs_Base.h>
 Public Attributes
double  | f_red
red component
double  | f_green
green component
double  | f_blue
blue component
double  | f_alpha
transparency
Detailed Description
RGB color reference with transparency.
Remarks
Each component expressed in [0.0... 1.0] interval. The {0.0, 0.0, 0.0} components represents the black, {1.0, 1.0, 1.0} the white color.
Member Data Documentation
◆ f_alpha
 API_RGBAColor::f_alpha
transparency
◆ f_blue
 API_RGBAColor::f_blue
blue component
◆ f_green
 API_RGBAColor::f_green
green component
◆ f_red
 API_RGBAColor::f_red
red component